Repository: atardamar07/ezan_hatirlatici
Catalog: lib/l10n/app_*.arb
Languages: ar, de, ru

# appTitle
source: Prayer Reminder
ar: منبّه الصلاة
de: Gebetserinnerung
ru: Напоминание о молитве

source: Select City
ar: اختر المدينة
de: Stadt auswählen
ru: Выберите город

source: Search city...
ar: ابحث عن مدينة...
de: Stadt suchen...
ru: Поиск города...

# useCurrentLocation
source: Use My Current Location
ar: استخدام موقعي الحالي
de: Meinen aktuellen Standort verwenden
ru: Использовать мое текущее местоположение

source: Popular Cities
ar: المدن الشهيرة
de: Beliebte Städte
ru: Популярные города

source: No city found
ar: لم يتم العثور على مدينة
de: Stadt nicht gefunden
ru: Город не найден

source: City not found
ar: لم يتم العثور على المدينة
de: Stadt nicht gefunden
ru: Город не найден

# locationError
source: Location could not be retrieved. Please check location permissions.
ar: تعذر الحصول على الموقع. يرجى التحقق من أذونات الموقع.
de: Standort konnte nicht abgerufen werden. Bitte überprüfen Sie die Standortberechtigungen.
ru: Не удалось получить местоположение. Пожалуйста, проверьте разрешения местоположения.

# locationErrorDetails
source: Error getting location: {error}
ar: حدث خطأ أثناء الحصول على الموقع: {error}
de: Fehler beim Abrufen des Standorts: {error}
ru: Ошибка получения местоположения: {error}

# prayerTimesLoadError
source: Failed to load prayer times. Please check location settings.
ar: فشل تحميل أوقات الصلاة. يرجى التحقق من إعدادات الموقع.
de: Gebetszeiten konnten nicht geladen werden. Bitte überprüfen Sie die Standorteinstellungen.
ru: Не удалось загрузить время молитвы. Пожалуйста, проверьте настройки местоположения.

# prayerTimesLoadFailed
source: Prayer times could not be loaded
ar: تعذر تحميل أوقات الصلاة
de: Gebetszeiten konnten nicht geladen werden
ru: Не удалось загрузить время молитвы

# error
source: Error: {error}
ar: خطأ: {error}
de: Fehler: {error}
ru: Ошибка: {error}

# genericError
source: Error:
ar: خطأ:
de: Fehler:
ru: Ошибка:

# locationPermissionError
source: Location permission denied. Please enable location services.
ar: تم رفض إذن الموقع. يرجى تمكين خدمات الموقع.
de: Standortberechtigung verweigert. Bitte aktivieren Sie die Standortdienste.
ru: Разрешение на местоположение отклонено. Пожалуйста, включите службы местоположения.

source: Current Location
ar: الموقع الحالي
de: Aktueller Standort
ru: Текущее местоположение

# nextPrayer
source: Next Prayer: {prayer}
ar: الصلاة التالية: {prayer}
de: Nächstes Gebet: {prayer}
ru: Следующая молитва: {prayer}

# nextPrayerSimple
source: Next Prayer
ar: الصلاة التالية
de: Nächstes Gebet
ru: Следующая молитва

source: Menu
ar: القائمة
de: Menü
ru: Меню

source: Home
ar: الرئيسية
de: Startseite
ru: Главная

source: Qibla Compass
ar: بوصلة القبلة
de: Qibla-Kompass
ru: Компас Киблы

source: Dhikr Counter
ar: عداد الذكر
de: Dhikr-Zähler
ru: Счетчик зикра

# donate
source: Support
ar: قدّم دعمًا
de: Unterstützen
ru: Пожертвовать

# donateButton
source: Send Support
ar: تقديم دعم
de: Unterstützen
ru: Пожертвовать

source: Retry
ar: إعادة المحاولة
de: Wiederholen
ru: Повторить

source: Settings
ar: الإعدادات
de: Einstellungen
ru: Настройки

source: Calculation Method
ar: طريقة الحساب
de: Berechnungsmethode
ru: Метод расчета

source: Cancel
ar: إلغاء
de: Abbrechen
ru: Отмена

source: Select Location
ar: اختر الموقع
de: Standort auswählen
ru: Выберите местоположение

source: Fajr
ar: الفجر
ru: Фаджр

source: Sunrise
ar: الشروق
de: Sonnenaufgang
ru: Восход

source: Dhuhr
ar: الظهر
ru: Зухр

source: Asr
ar: العصر
ru: Аср

source: Maghrib
ar: المغرب
ru: Магриб

source: Isha
ar: العشاء
ru: Иша

# timeRemainingHours
source: ⏳ {hours}h {minutes}m left
ar: ⏳ متبقي {hours} س {minutes} د
de: ⏳ {hours} Std {minutes} Min übrig
ru: ⏳ Осталось {hours} ч {minutes} мин

# timeRemainingMinutes
source: ⏳ {minutes}m {seconds}s left
ar: ⏳ متبقي {minutes} د {seconds} ث
de: ⏳ {minutes} Min {seconds} Sek übrig
ru: ⏳ Осталось {minutes} мин {seconds} сек

# timeRemainingSeconds
source: ⏳ {seconds}s left
ar: ⏳ متبقي {seconds} ث
de: ⏳ {seconds} Sek übrig
ru: ⏳ Осталось {seconds} сек

# timeEntered
source: 🕌 Time has entered
ar: 🕌 حان وقت الصلاة
de: 🕌 Zeit ist eingetreten
ru: 🕌 Время наступило

# invalidTime
source: Invalid time information
ar: معلومات الوقت غير صالحة
de: Ungültige Zeitinformationen
ru: Недействительная информация о времени

source: Qibla Direction
ar: اتجاه القبلة
de: Qibla-Richtung
ru: Компас Киблы

# qiblaFound
source: You are facing Qibla
ar: أنت تواجه القبلة
de: Sie schauen in Richtung Qibla
ru: Вы смотрите в сторону Киблы

source: Turn Right
ar: استدر لليمين
de: Drehen Sie sich nach rechts
ru: Повернитесь направо

source: Turn Left
ar: استدر لليسار
de: Drehen Sie sich nach links
ru: Повернитесь налево

# distanceToKaaba
source: Distance to Kaaba: {distance} km
ar: المسافة إلى الكعبة: {distance} كم
de: Entfernung zur Kaaba: {distance} km
ru: Расстояние до Каабы: {distance} км

# youAreFacingQibla
source: You are currently facing Qibla
ar: أنت تواجه القبلة الآن
de: Sie schauen jetzt in Richtung Qibla
ru: Вы сейчас смотрите в сторону Киблы

source: Dhikr Settings
ar: إعدادات الذكر
de: Dhikr-Einstellungen
ru: Настройки зикра

source: Select Dhikr
ar: اختر الذكر
de: Dhikr auswählen
ru: Выберите зикр

source: Target Count
ar: العدد المستهدف
de: Zielanzahl
ru: Целевое количество

source: Vibration
ar: الاهتزاز
ru: Вибрация

source: Sound
ar: الصوت
de: Ton
ru: Звук

source: Save
ar: حفظ
de: Speichern
ru: Сохранить

source: Congratulations!
ar: مبروك!
de: Herzlichen Glückwunsch!
ru: Поздравляем!

# completedDhikr
source: You have completed {dhikr} {count} times!
ar: لقد أكملت ذكر {dhikr} {count} مرة!
de: Sie haben Dhikr {dhikr} {count} Mal abgeschlossen!
ru: Вы завершили зикр {dhikr} {count} раз(а)!

source: Restart
ar: إعادة البدء
de: Neu starten
ru: Начать сначала

# continueText
source: Continue
ar: متابعة
de: Weitermachen
ru: Продолжить

source: Reset
ar: إعادة تعيين
de: Zurücksetzen
ru: Сбросить

source: Count
ar: عد
de: Zählen
ru: Считать

# tapToCount
source: Tap the screen to increase your dhikr count
ar: اضغط على الشاشة لزيادة عدد الأذكار
de: Tippen Sie auf den Bildschirm, um Ihre Dhikr-Anzahl zu erhöhen
ru: Нажмите на экран, чтобы увеличить количество зикра

# donationsForWeb
source: Support Options Available on Mobile App
ar: خيارات الدعم متاحة في تطبيق الجوال
de: Unterstützung ist in der mobilen App verfügbar
ru: Пожертвования доступны в мобильном приложении

# donateInfo
source: You can leave an optional tip using the app on your Android or iOS device.
ar: يمكنك إرسال دعم اختياري عبر تطبيق Android أو iOS.
de: Du kannst eine freiwillige Unterstützung über die Android- oder iOS-App senden.
ru: Вы можете пожертвовать, используя приложение на устройстве Android или iOS.

# donationTitle
source: Support / Tip
ar: دعم التطبيق
de: App unterstützen
ru: Пожертвовать

source: Thank You!
ar: شكراً لك!
de: Vielen Dank!
ru: Спасибо!

# donationSuccess
source: Thank you for your support!
ar: شكراً جزيلاً على دعمك!
de: Vielen Dank für deine Unterstützung!
ru: Большое спасибо за ваше пожертвование!

# noAds
source: You will no longer see ads in the app.
ar: لن ترى إعلانات بعد الآن في التطبيق.
de: Sie werden keine Anzeigen mehr in der App sehen.
ru: Теперь вы не будете видеть рекламу в приложении.

# donationFailed
source: Support payment failed: {error}
ar: فشل دفع الدعم: {error}
de: Unterstützung fehlgeschlagen: {error}
ru: Сбой пожертвования: {error}

# errorTitle
source: Error
ar: خطأ
de: Fehler
ru: Ошибка

# hasDonatedThanks
source: Thank you for your support!
ar: شكراً جزيلاً على دعمك!
de: Vielen Dank für deine Unterstützung!
ru: Большое спасибо за ваше пожертвование!

# supportApp
source: Would you like to leave a tip for the app?
ar: هل ترغب في دعم التطبيق بإكرامية؟
de: Möchtest du die App mit einem Trinkgeld unterstützen?
ru: Хотите поддержать приложение?

# adFreeExperience
source: Enjoy your ad-free experience
ar: استمتع بتجربة خالية من الإعلانات
de: Genießen Sie Ihre werbefreie Erfahrung
ru: Наслаждайтесь безрекламным опытом

# supportOptionalText
source: Tips are completely optional and not required to use the app.
ar: الدعم اختياري بالكامل وليس مطلوبًا لاستخدام التطبيق.
de: Die Unterstützung ist völlig freiwillig und nicht erforderlich, um die App zu nutzen.

# donationInfoText
source: Tips are processed via Google Play Billing and are used for development costs.
ar: تُعالج مبالغ الدعم عبر فوترة Google Play وتُستخدم لتكاليف التطوير.
de: Unterstützungen werden über Google Play Abrechnung abgewickelt und helfen bei Entwicklung und Serverkosten.
ru: Ваши пожертвования будут использованы для разработки приложения и покрытия расходов на сервер.

# noAdsFor30Days
source: No ads will be shown for 30 days after donating.
ar: لن يتم عرض إعلانات لمدة 30 يوماً بعد التبرع.
de: Es werden 30 Tage lang keine Anzeigen angezeigt, nachdem Sie gespendet haben.
ru: Реклама не будет показываться в течение 30 дней после пожертвования.

# coffeeDonation
source: ☕ Small Tip
ar: ☕ دعم صغير
de: ☕ Kleine Unterstützung
ru: ☕ Чашка кофе

# coffeeDescription
source: One-time small show of support
ar: مساهمة بسيطة لمرة واحدة
de: Einmaliger kleiner Beitrag
ru: Угостить разработчика кофе

# mealDonation
source: 🍽️ Standard Support
ar: 🍽️ دعم قياسي
de: 🍽️ Standard-Unterstützung
ru: 🍽️ Еда

# mealDescription
source: One-time support to keep improvements coming
ar: دعم لمرة واحدة لمواصلة التحسين
de: Einmalige Unterstützung für weitere Verbesserungen
ru: Угостить разработчика едой

# generousDonation
source: 💎 Big Support
ar: 💎 دعم سخي
de: 💎 Große Unterstützung
ru: 💎 Щедрое пожертвование

# generousDescription
source: A generous tip to help grow the app
ar: إكرامية سخية للمساعدة في تطوير التطبيق
de: Großzügiges Trinkgeld, um die App auszubauen
ru: Поддержать разработку приложения

# locationNotDetected
source: Location not detected. Please select a city manually.
ar: تعذر الحصول على الموقع. يرجى اختيار المدينة يدوياً.
de: Standort nicht erkannt. Bitte wählen Sie eine Stadt manuell aus.
ru: Не удалось получить местоположение. Пожалуйста, выберите город вручную.

# failedToLoadPrayerTimes
source: Failed to load prayer times. Please check location settings.
ar: فشل تحميل أوقات الصلاة. يرجى التحقق من إعدادات الموقع.
de: Gebetszeiten konnten nicht geladen werden. Bitte überprüfen Sie die Standorteinstellungen.
ru: Не удалось загрузить время молитвы. Пожалуйста, проверьте настройки местоположения.

source: Tomorrow
ar: غدًا
de: Morgen
ru: Завтра

source: Tomorrow Fajr
ar: فجر الغد
de: Morgen Fadschr
ru: Завтра Фаджр

# prayerTimeEntered
source: Prayer time has started
ar: بدأ وقت الصلاة
de: Gebetszeit hat begonnen
ru: Время молитвы началось

# subhanallahMeaning
source: Allah is free from imperfections.
ar: الله منزّه عن النقصان.
de: Allah ist frei von Mängeln.
ru: Аллах свободен от недостатков.

# alhamdulillahMeaning
source: Praise be to Allah.
ar: الحمد لله.
de: Alles Lob gebührt Allah.
ru: Хвала Аллаху.

# allahuAkbarMeaning
source: Allah is the Greatest.
ar: الله أكبر.
de: Allah ist am größten.
ru: Аллах – величайший.

# laIlaheIllallahMeaning
source: There is no deity except Allah.
ar: لا إله إلا الله.
de: Es gibt keine Gottheit außer Allah.
ru: Нет божества, кроме Аллаха.

# astagfirullahMeaning
source: I seek forgiveness from Allah.
ar: أستغفر الله.
de: Ich bitte Allah um Vergebung.
ru: Прошу прощения у Аллаха.

# hasbunallahMeaning
source: Allah is sufficient for us.
ar: حسبنا الله.
de: Allah genügt uns.
ru: Нам достаточно Аллаха.

# savedLocation
source: Saved location: {location}
ar: الموقع المحفوظ: {location}
de: Gespeicherter Ort: {location}
ru: Сохранённое местоположение: {location}

source: Detecting location...
ar: جارٍ تحديد الموقع...
de: Standort wird ermittelt...
ru: Определение местоположения...

# locationPermissionActive
source: Location permission active: {location}
ar: إذن الموقع مفعّل: {location}
de: Standortfreigabe aktiv: {location}
ru: Доступ к геоданным разрешён: {location}

# locationPermissionLimited
source: Location permission is off. Notifications may be limited.
ar: إذن الموقع مغلق. قد تكون الإشعارات محدودة.
de: Standortfreigabe deaktiviert. Benachrichtigungen sind ggf. eingeschränkt.
ru: Доступ к геоданным выключен. Уведомления могут быть ограничены.

# locationUpdated
source: Location updated: {location}
ar: تم تحديث الموقع: {location}
de: Standort aktualisiert: {location}
ru: Местоположение обновлено: {location}

# citySelected
source: City selected: {location}
ar: تم اختيار المدينة: {location}
de: Stadt gewählt: {location}
ru: Город выбран: {location}

# locationPermissionGranted
source: Location permission active
ar: إذن الموقع مفعّل
de: Standortberechtigung aktiv
ru: Разрешение на местоположение активно

# locationPermissionPending
source: Waiting for location permission
ar: بانتظار إذن الموقع
de: Warten auf Standortberechtigung
ru: Ожидание разрешения на местоположение

source: Notifications ready
ar: الإشعارات جاهزة
de: Benachrichtigungen bereit
ru: Уведомления готовы

# notificationsPending
source: Waiting for notification permission
ar: بانتظار إذن الإشعارات
de: Benachrichtigungsberechtigung ausstehend
ru: Ожидается разрешение на уведомления

# quickActionToday
source: Today
ar: اليوم
de: Heute
ru: Сегодня

# quickActionWeekly
source: Weekly view
ar: عرض أسبوعي
de: Wochenansicht
ru: Неделя

# quickActionNotifications
source: Notifications
ar: الإشعارات
de: Benachrichtigungen
ru: Уведомления

# locationInfoMissing
source: Location information not found.
ar: معلومات الموقع غير موجودة.
de: Standortinformationen nicht gefunden.
ru: Информация о местоположении не найдена.

# cityInfoMissing
source: City information not found.
ar: معلومات المدينة غير موجودة.
de: Stadtinformationen nicht gefunden.
ru: Информация о городе не найдена.

# selectLocationOrCity
source: Please select a location or city first.
ar: يرجى اختيار موقع أو مدينة أولاً.
de: Bitte zuerst einen Standort oder eine Stadt wählen.
ru: Сначала выберите местоположение или город.

# weeklyTimesUnavailable
source: Weekly prayer times could not be retrieved.
ar: تعذر جلب أوقات الصلاة الأسبوعية.
de: Wöchentliche Gebetszeiten konnten nicht abgerufen werden.
ru: Не удалось получить недельные времена молитв.

source: Data unavailable
ar: البيانات غير متاحة
de: Keine Daten verfügbar
ru: Данные недоступны

# weeklyViewTitle
source: Weekly View
ar: عرض أسبوعي
de: Wochenansicht
ru: Недельный вид

source: Refresh
ar: تحديث
de: Aktualisieren
ru: Обновить

# weeklyDataMissing
source: Weekly data not found.
ar: لا توجد بيانات أسبوعية.
de: Wöchentliche Daten nicht gefunden.
ru: Недельные данные не найдены.

# noDataForDay
source: No data available for the selected day.
ar: لا تتوفر بيانات لليوم المحدد.
de: Keine Daten für den ausgewählten Tag.
ru: Нет данных для выбранного дня.

# calendarTitle
source: Calendar
ar: التقويم
de: Kalender
ru: Календарь

# monthlyLabel
source: Monthly
ar: شهري
de: Monatlich
ru: Месяц

# weeklyLabel
source: Weekly
ar: أسبوعي
de: Wöchentlich
ru: Неделя

source: Selected day times
ar: أوقات اليوم المحدد
de: Zeiten für den gewählten Tag
ru: Времена выбранного дня

# notificationsTitle
source: Notifications
ar: الإشعارات
de: Benachrichtigungen
ru: Уведомления

# notificationInfoLine1
source: Prayer reminders arrive on time when you enable them.
ar: تصل تذكيرات الصلاة في وقتها عند تفعيلها.
de: Gebets-Erinnerungen kommen rechtzeitig an, wenn sie aktiviert sind.
ru: Напоминания о намазе приходят вовремя, когда они включены.

# notificationInfoLine2
source: Manage notification permissions from device settings and enable adhan sounds.
ar: يمكنك إدارة أذونات الإشعارات من إعدادات الجهاز وتفعيل أذان الصوت.
de: Verwalte die Berechtigungen in den Geräteeinstellungen und aktiviere Adhan-Töne.
ru: Управляйте разрешениями в настройках устройства и включайте звук азана.

source: Notification status
ar: حالة الإشعارات
de: Benachrichtigungsstatus
ru: Статус уведомлений

source: Notification permission
ar: إذن الإشعارات
de: Benachrichtigungsberechtigung
ru: Разрешение на уведомления

source: Permission granted
ar: تم منح الإذن
de: Berechtigung erteilt
ru: Разрешено

source: Permission denied
ar: الإذن مرفوض
de: Berechtigung verweigert
ru: Запрещено

source: Exact alarm permission
ar: إذن التنبيه الدقيق
de: Exact-Alarm-Berechtigung
ru: Разрешение на точные будильники

source: Scheduling active
ar: الجدولة مفعّلة
de: Planung aktiv
ru: Планирование активно

source: Exact alarm disabled
ar: التنبيه الدقيق معطّل
de: Exact-Alarm deaktiviert
ru: Точные будильники выключены

source: Sound notification
ar: إشعار صوتي
de: Tonbenachrichtigung
ru: Звуковое уведомление

# soundOn
source: Adhan sound on
ar: صوت الأذان مفعّل
de: Adhan-Ton an
ru: Звук азана включён

source: Sound off
ar: الصوت معطّل
de: Ton aus
ru: Звук выключен

source: Ad control
ar: التحكم بالإعلانات
de: Werbekontrolle
ru: Контроль рекламы

source: SDK initialized
ar: تم تهيئة الـSDK
de: SDK initialisiert
ru: SDK инициализирован

# statusReady
source: Ready
ar: جاهز
de: Bereit
ru: Готово

# statusWaiting
source: Initialization pending
ar: بانتظار التهيئة
de: Initialisierung ausstehend
ru: Ожидание инициализации

# bannerAd
source: Banner
ar: لافتة
ru: Баннер

source: Loaded
ar: تم التحميل
de: Geladen
ru: Загружено

source: Not loaded
ar: غير محمّل
de: Nicht geladen
ru: Не загружено

# interstitialAd
source: Interstitial
ar: إعلان انتقالي
ru: Межстраничная реклама

source: Showing
ar: قيد العرض
de: Wird angezeigt
ru: Показывается

source: Not ready
ar: غير جاهز
de: Nicht bereit
ru: Не готово

# locationStatusOn
source: Location enabled
ar: الموقع مفعّل
de: Standort aktiv
ru: Геолокация включена

# locationStatusOff
source: Location disabled
ar: الموقع معطّل
de: Standort deaktiviert
ru: Геолокация выключена

# internetStatusOn
source: Internet active
ar: الاتصال نشط
de: Internet aktiv
ru: Интернет активен

# internetStatusOff
source: No internet
ar: لا يوجد إنترنت
de: Kein Internet
ru: Нет интернета

# prayerNotificationsTitle
source: Prayer notifications
ar: إشعارات الصلاة
de: Gebets-Benachrichtigungen
ru: Уведомления о молитве

# prayerNotificationsSubtitle
source: Manage notification time and status for each prayer.
ar: إدارة وقت وحالة كل إشعار.
de: Verwalte Uhrzeit und Status jeder Benachrichtigung.
ru: Управляйте временем и статусом каждого уведомления.

# notificationEnabled
source: Notification on
ar: الإشعار مفعّل
de: Benachrichtigung an
ru: Уведомление включено

# notificationDisabled
source: Notification off
ar: الإشعار معطّل
de: Benachrichtigung aus
ru: Уведомление выключено

# notificationOptionsTitle
source: Notification options
ar: خيارات الإشعارات
de: Benachrichtigungsoptionen
ru: Параметры уведомлений

# notificationOptionsSubtitle
source: Quiet hours and pre-alert preferences
ar: أوقات الصمت والتنبيه المسبق
de: Ruhezeiten und Vorab-Warnungen
ru: Тихие часы и предварительные оповещения

# quietHoursLabel
source: Quiet hours
ar: أوقات الصمت
de: Ruhezeiten
ru: Тихие часы

# quietHoursShort
source: {hours} h
ar: {hours} س
de: {hours} Std
ru: {hours} ч

# quietHoursLong
source: {hours} hours
ar: {hours} ساعة
de: {hours} Stunden
ru: {hours} часов

source: Pre-alert
ar: تنبيه مسبق
de: Vorab-Warnung
ru: Предварительное оповещение

# preAlertOff
source: Off
ar: متوقف
de: Aus
ru: Выкл.

# preAlertMinutes
source: {minutes} minutes before
ar: {minutes} دقيقة قبل
de: {minutes} Minuten vorher
ru: За {minutes} мин.

source: System theme
ar: سمة النظام
de: Systemdesign
ru: Тема системы

# systemThemeSubtitle
source: Follows device settings
ar: يتبع إعدادات الجهاز
de: Folgt den Geräteeinstellungen
ru: Следовать настройкам устройства

source: Light theme
ar: سمة فاتحة
de: Hell
ru: Светлая тема

# lightThemeSubtitle
source: Daytime look
ar: مظهر النهار
de: Tagesansicht
ru: Дневной вид

source: Dark theme
ar: سمة داكنة
de: Dunkel
ru: Тёмная тема

# darkThemeSubtitle
source: Nighttime look
ar: مظهر الليل
de: Nachtansicht
ru: Ночной вид

# methodDiyanetName
source: Presidency of Religious Affairs
ar: رئاسة الشؤون الدينية

# methodDiyanetDescription
source: Official method for Türkiye
ar: الطريقة الرسمية لتركيا

# methodMwlName
source: Muslim World League
ar: رابطة العالم الإسلامي

# methodMwlDescription
source: General international method
ar: طريقة دولية عامة

# methodEgyptianName
source: Egyptian General Authority
ar: الهيئة العامة المصرية

# methodEgyptianDescription
source: Egyptian method
ar: الطريقة المصرية

# methodKarachiName
source: Karachi
ar: كراتشي

# methodKarachiDescription
source: Pakistan method
ar: الطريقة الباكستانية

# methodUmmAlQuraName
source: Umm Al-Qura
ar: أم القرى

# methodUmmAlQuraDescription
source: Saudi Arabia
ar: المملكة العربية السعودية

# methodMoonsightingName
source: University of Islamic Sciences
ar: جامعة العلوم الإسلامية

# methodMoonsightingDescription
source: Jordan / University of Islamic Sciences
ar: الأردن / جامعة العلوم الإسلامية

# methodTehranName
source: Institute of Geophysics, Tehran
ar: معهد الجيوفيزياء، طهران

# methodTehranDescription
source: Iran method
ar: الطريقة الإيرانية

# methodFranceName
source: Union of Islamic Organisations
ar: اتحاد المنظمات الإسلامية

# methodFranceDescription
source: France method
ar: الطريقة الفرنسية
